Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1
The Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1 class defines an Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Update(`0) function
for any Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator modifying a specific Tekla.Structures.Model.ModelObject type.
The type of Tekla.Structures.Model.ModelObject modified by the manipulator.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.#ctor(`0)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1 class.
modelObject: The initial instance to set to Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target.
Throws System.ArgumentNullException:
Thrown when the modelObject is null.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target
Gets the manipulated .

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Update(`0)
Updates the manipulator to target the given modelObject instance.
Remarks:
Calling this method causes the given modelObject instance to be set to Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target,
then Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.OnTargetObjectUpdated(`0) is called with the old value of Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target
and finally Manipulator.UpdateView is called.
Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.OnTargetObjectUpdated(`0)
Manipulator.UpdateView
modelObject: The value to set to the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target property.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.OnTargetObjectUpdated(`0)
When overridden, handles changes of the  instance behind the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target property.
oldInstance: The previous instance set to Tekla.Structures.DirectManipulation.Model.ModelObjectManipulator`1.Target.